app/controllers/articles_controller.rb

  def index
    @archives = Article.group_by_month(:created_at, format: '%B %Y', locale: :en).count

    category = @categories.find { |c| c.name == params[:category] } if params[:category].present?
    month_year = @archives.find { |m| m[0] == params[:month_year] }&.first if params[:month_year].present?

    @highlights = Article.includes(:category, :user)
                         .filter_by_category(category)
                         .filter_by_archive(month_year)
                         .desc_order
                         .first(3)

    highlight_ids = @highlights.pluck(:id).join(',')

    @articles = Article.includes(:category, :user)
                       .without_highlights(highlight_ids)
                       .filter_by_category(category)
                       .filter_by_archive(month_year)
                       .desc_order
                       .page(current_page)
---
SELECT COUNT(*) AS count_all, strftime('%Y-%m-01', "articles"."created_at") AS strftime_y_m_01_articles_created_at FROM "articles" WHERE ("articles"."created_at" IS NOT NULL) GROUP BY strftime('%Y-%m-01', "articles"."created_at")
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC LIMIT ?  [["LIMIT", 3]]
SELECT "articles".* FROM "articles" WHERE "articles"."created_at" BETWEEN ? AND ? ORDER BY "articles"."created_at" DESC LIMIT ?  [["created_at", "2022-03-01"], ["created_at", "2022-04-01"], ["LIMIT", 3]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?)  [["id", 9], ["id", 5], ["id", 8]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 3], ["id", 2]]
SELECT "articles".* FROM "articles" WHERE (id NOT IN (7,2)) AND "articles"."category_id" = ? ORDER BY "articles"."created_at" DESC LIMIT ? OFFSET ?  [["category_id", 2], ["LIMIT", 5], ["OFFSET", 0]]

  def show
    @article = Article.includes(comments: :user).find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 69], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @article = current_user.articles.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "category_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "asdasd"], ["body", "asdasdasdasd"], ["created_at", "2022-07-25 13:28:48.513988"], ["updated_at", "2022-07-25 13:28:48.513988"], ["category_id", 5], ["user_id", 3]]

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "body" = ?, "updated_at" = ?, "category_id" = ? WHERE "articles"."id" = ?