app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?)

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?