app/controllers/categories_controller.rb

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Mobile"], ["updated_at", "2022-07-19 13:26:28.617939"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @category.update(category_params)

DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 4]]
---
  def destroy
    if @category.destroy