app/controllers/comments_controller.rb

  def create
    @article.comments.create(comment_params.to_h.merge!({ user_id: current_user.id }))
---
INSERT INTO "comments" ("body", "article_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    comment = @article.comments.find(params[:id])
    authorize comment

    comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 69], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]

  def set_article
    @article = Article.find(params[:article_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 69], ["LIMIT", 1]]